<template>
  <div>
    <h1
      v-if="showTitle"
      class="text-bold text-h6"
    >
      Условия предоставления сервиса
    </h1>
    <ol :class="$style.tosOl">
      <li>
        Термины и определения
        <ol>
          <li>
            Для целей настоящего Пользовательского соглашения (далее – Соглашение) нижеуказанные термины имеют следующие значения:
            <ol>
              <li>Сайт – Интернет-ресурс о недвижимости, расположенный в сети Интернет по адресу https://kvarum.ru. Под Сайтом в зависимости от контекста понимается также программное обеспечение Сайта, дизайн (графическое оформление) Сайта, База данных, любой раздел (подраздел) Сайта (объявления, Форум и др.), а также Информация, размещенная на Сайте Администрацией Сайта и Пользователями.</li>
              <li>
                Администрация Сайта – ООО Кварум, которое обладает всеми необходимыми правами в отношении Сайта,
                включая право на использование доменного имени Сайта, и осуществляющее администрирование Сайта.
              </li>
              <li>Регистрация – процесс создания Учетной записи Пользователя на Сайте.</li>
              <li>
                Авторизация – процесс идентификации зарегистрированного Пользователя путём ввода логина
                Пользователя/номера его мобильного телефона (либо иных данных) и пароля, для получения доступа к Учетной
                записи Пользователя, закрытым разделам и расширенному функционалу Сайта.
              </li>
              <li>
                Пользователь – лицо, прошедшее Процедуру регистрации. Для целей настоящего Соглашения под
                Пользователем понимается также лицо, которое не прошло Процедуру регистрации, но осуществляет доступ к
                Сайту и/или использует и/или использовало его.
              </li>
              <li>
                Объект — объект недвижимости, услуга и/или предложение, связанное с куплей, продажей, арендой
                недвижимости, в отношении которого на Кварум демонстрируется Объявление.
              </li>
              <li>
                Объявление — информационное сообщение с предложением об Объекте (включая контактную информацию,
                фотографии и любую сопутствующую информацию), опубликованное на Кварум, адресованное неопределенному
                кругу лиц.
              </li>
              <li>
                Продавец — физическое лицо, контактные данные которого указаны в Объявлении на сайте Кварум,
                зарегистрировавшийся в качестве Пользователя в установленном порядке. Продавцом может быть как
                собственник объекта, так и его представитель – физическое лицо.
              </li>
              <li>
                Покупатель — Пользователь, осуществляющий просмотр демонстрируемых на Кварум Объявлений и (или)
                взаимодействие с Продавцом в отношении Объекта и/или заключающий сделку с Продавцом,
                зарегистрировавшийся в качестве Пользователя в установленном порядке.
              </li>
              <li>
                Агентство недвижимости – юридическое лицо, оказывающее услуги физическим и юридическим лицам на
                рынке недвижимости.
              </li>
              <li>
                Риэлтор – физическое лицо, зарегистрированное в качестве индивидуального предпринимателя или
                являющееся сотрудником агентства недвижимости, оказывающее услуги физическим и юридическим лицам на
                рынке недвижимости
              </li>
              <li>
                Заказчик – юридическое лицо, осуществляющее на Сайте коммерческую деятельность на основании
                соответствующего договора с Администрацией Сайта и зарегистрировавшееся в качестве Пользователя в
                установленном порядке, имеющее в определенных случаях доступ к дополнительному функционалу Сайта. В
                отношении Заказчика действуют все правила настоящего Соглашения, установленные для иных Пользователей.
              </li>
              <li>
                Коммерческая деятельность – неоднократное использование Сайта для получения прибыли.
                Администрация Сайта может самостоятельно определять факт ведения Коммерческой деятельности
                Пользователями Сайта.
              </li>
              <li>
                Учетная запись Пользователя – специальный подраздел Сайта, позволяющий Пользователю получить
                доступ к определенному функционалу Сайта, а также получить доступ к Персональной информации
                Пользователя, размещенной в рамках Учетной записи, и иной Информации. Заказчик в определенных случаях
                получает доступ к отдельной Учетной записи, обладающей дополнительным функционалом (Личный кабинет
                Заказчика).
              </li>
              <li>
                Персональная информация Пользователя – любая информация, которую Пользователь предоставляет о
                себе самостоятельно при регистрации (создании Учетной записи Пользователя) или в процессе использования
                Сайта, включая персональные данные Пользователя, а также информация, которая автоматически передается
                Администрации Сайта в процессе использования Сайта с помощью установленного на устройстве Пользователя
                программного обеспечения, в том числе IP-адрес, информация из cookie, информация о браузере
                Пользователя, геолокационные данные устройств Пользователя, данные о действиях Пользователя на Сайте, а
                также иные данные о Пользователе.
              </li>
              <li>
                Информация – любая информация, размещаемая (размещенная) Пользователем или Администрацией Сайта
                на Сайте, в том числе: объявления о продаже/аренде объектов недвижимости, сообщения на Форуме,
                Персональная информация Пользователя, ссылки на другие сайты, любые текстовые сообщения, фотографии
                (изображения), аудио- и/или видео-произведения, компьютерные программы, дизайн Сайта и т.п.
              </li>
              <li>
                База данных – совокупность Информации, размещенной на Сайте. Вся Информация, размещенная на
                Сайте, а также подбор, группировка и расположение Информации, является интеллектуальной собственностью
                Администрации Сайта и (или) иных правообладателей.
              </li>
              <li>
                Блокировка – временное прекращение доступа Пользователя к ресурсам Сайта, в некоторых случаях с
                запретом авторизации.
              </li>
              <li>
                Заморозка – прекращение отображения Информации на Сайте (сама Информация, например, объявления,
                остается доступной Пользователям для изменения и редактирования).
              </li>
              <li>
                Форум – раздел Сайта, предназначенный для общения Пользователей на темы, заданные Администрацией
                Сайта или самими Пользователями.
              </li>
              <li>
                Модератор – Пользователь, имеющий по сравнению с другими Пользователями на Сайте более широкие
                права, предоставленные Администрацией Сайта в порядке, установленном настоящим Соглашением.
              </li>
            </ol>
          </li>
          <li>
            Любые термины и понятия, использующиеся в настоящем Соглашении и не нашедшие отражения в разделе «Термины и определения», будут толковаться в соответствии со смыслом, вытекающим из текста настоящего Соглашения. В случае если смысл термина или понятия не представляется возможным определить из текста настоящего Соглашения, то смысл соответствующего термина или понятия определяется исходя из действующего законодательства Российской Федерации либо из сложившейся в сети Интернет практики.
          </li>
        </ol>
      </li>
      <li>
        Предмет и общие положения настоящего Соглашения
        <ol>
          <li>
            Настоящее Соглашение устанавливает правила и условия использования Сайта, размещения на Сайте Информации и
            порядок использования такой Информации, а также общие правила участия в Форуме, и представляет собой договор
            между Пользователем и Администрацией Сайта.
          </li>
          <li>
            Доступ к Сайту, использование Сайта и/или совершение любых иных действий на Сайте Пользователем означает, что
            Пользователь принимает и обязуется соблюдать все условия настоящего Соглашения без оговорок и исключений.
            Регистрация Пользователя на Сайте возможна только при дополнительном подтверждении Пользователем принятия
            настоящего Соглашения. Если Пользователь не согласен с условиями Соглашения, то он должен немедленно прекратить
            использование Сайта.
          </li>
        </ol>
      </li>
      <li>
        Регистрация на Сайте
        <ol>
          <li>
            Для того чтобы получить доступ ко всем возможностям Сайта, лицо должно пройти процедуру регистрации, а
            именно совершить ряд последовательных действий по заполнению регистрационной формы, в результате которых для
            Пользователя будет создана уникальная Учетная запись.
          </li>
          <li>
            Любой Пользователь вправе иметь только одну Учетную запись на Сайте. В случае нарушения Пользователем
            данного правила Администрация Сайта может заблокировать Учетные записи Пользователя (включая Личный кабинет
            (ы) Заказчика), а также удалить Информацию Пользователя.
          </li>
          <li>
            Пользователь соглашается предоставлять правдивую, точную и полную информацию о себе в регистрационной
            форме и поддерживать эту информацию в актуальном состоянии. Если эта информация изменится, Пользователь
            обязуется изменить ее как можно скорее. При этом Пользователь соглашается, что Администрация Сайта в общем
            случае не обязана проверять достоверность информации, предоставленной Пользователем о себе, или осуществлять
            контроль за дееспособностью Пользователя.
          </li>
          <li>
            Администрация Сайта вправе заблокировать и/или удалить Учетную запись Пользователя, отказать
            Пользователю в доступе ко всем или некоторым возможностям Сайта и удалить Информацию Пользователя, в случае
            если Пользователь предоставил неверную информацию о себе, или у Администрации Сайта будут основания полагать,
            что предоставленная Пользователем информация о себе недостоверна, неполна, неточна, нарушает условия
            настоящего Соглашения или Пользователь использует чужую информацию.
          </li>
          <li>
            Администрация Сайта оставляет за собой право в любой момент потребовать от Пользователя подтверждения
            информации, предоставленной Пользователем о себе, и запросить в связи с этим подтверждающие документы (в
            частности - документы, удостоверяющие личность). В случае непредоставления указанных документов или если
            информация Пользователя, указанная в предоставленных им документах, не соответствуют информации, указанной
            Пользователем о себе на Сайте, а также в случае, когда информация, указанная Пользователем о себе на Сайте, не
            позволяет идентифицировать Пользователя, Администрация Сайта по своему усмотрению может принять меры,
            предусмотренные п. 3.5. Соглашения.
          </li>
        </ol>
      </li>
      <li>
        Авторизация на Сайте
        <ol>
          <li>
            Индивидуальный логин и/или пароль Пользователя, необходимый для авторизации на Сайте, предназначен только
            для этого Пользователя. Если любое лицо помимо Пользователя авторизуется на Сайте, используя логин и пароль
            Пользователя, то все действия, совершенные таким лицом, будут считаться совершенными этим Пользователем.
            Пользователь самостоятельно несет ответственность за все действия, совершенные им на Сайте, а также за все
            действия, совершенные на Сайте любыми иными лицами с использованием логина и пароля Пользователя.
          </li>
          <li>
            Пользователь обязуется не разглашать, не передавать третьим лицам свои логин и пароль, а также
            предпринять все необходимые усилия для того, чтобы его логин и пароль не были доступны третьим лицам.
            Пользователь самостоятельно несет ответственность за сохранность своего пароля, а также за все последствия,
            которые могут возникнуть в результате его несанкционированного и/или иного использования. Пользователь обязан
            немедленно уведомить Администрацию Сайта о любом случае несанкционированной (не разрешенной Пользователем)
            авторизации на Сайте с использованием логина и пароля и/или о любом нарушении (подозрениях о нарушении)
            конфиденциальности своего пароля.
          </li>
        </ol>
      </li>
      <li>
        Персональная информация Пользователя
        <ol>
          <li>
            Администрация Сайта при обработке Персональной информации Пользователя обязуется принять все разумные
            организационные и технические меры для защиты Персональной информации Пользователя от неправомерного доступа,
            уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с
            ней третьих лиц. Однако не исключено, что в результате сбоя в работе Сайта, вирусной или хакерской атаки,
            технических неисправностей и иных обстоятельств третьи лица могут получить неправомерный доступ к Персональной
            информации Пользователя, а также Персональная информация Пользователя может быть уничтожена, изменена,
            блокирована, скопирована, распространена либо с ней могут быть совершены иные неправомерные действия.
            Пользователь это понимает и соглашается с тем, что не будет предъявлять претензии к Администрации Сайта в
            связи с этим.
          </li>
          <li>
            Пользователь соглашается с тем, что его Персональная информация, содержащаяся в Учетной записи
            Пользователя (Личном кабинете Собственника или Агента) является общедоступной, и любой Пользователь Сайта
            может ознакомиться с ней, за исключением Персональной информации, доступ к которой Пользователь может
            ограничить при наличии соответствующего функционала Сайта.
          </li>
          <li>
            Пользователь соглашается с тем, что Администрация Сайта собирает, хранит и совершает иные действия по
            обработке Персональной информации Пользователя для следующих целей:
            <ol>
              <li>идентификация стороны в рамках соглашений и договоров с Администрацией Сайта;</li>
              <li>предоставление Пользователю персонализированных услуг;</li>
              <li>
                связь с Пользователем, в том числе направление уведомлений, запросов и информации, касающихся
                использования Сайта, оказания услуг, а также обработка запросов и заявок от Пользователя;
              </li>
              <li>улучшение качества Сайта, удобства его использования, разработка новых сервисов и услуг;</li>
              <li>таргетирование рекламных материалов;</li>
              <li>проведение статистических и иных исследований на основе обезличенных данных;</li>
              <li>составление базы данных Пользователей Сайта.</li>
            </ol>
          </li>

          <li>
            Размещая на Сайте свою Персональную информацию, Пользователь подтверждает, что делает это добровольно, а
            также что он добровольно предоставляет данную Информацию Администрации Сайта.
          </li>
          <li>
            Пользователь обязуется не размещать на Сайте персональную информацию других лиц, а также не использовать
            персональную информацию других Пользователей, каким-либо образом не соответствующим требованиям
            законодательства Российской Федерации, в целях извлечения выгоды и в любых иных целях, не соответствующих
            целям создания Сайта и настоящему Соглашению.
          </li>
          <li>
            Пользователь может в любой момент изменить (обновить, дополнить) либо удалить предоставленную им
            Персональную информацию или её часть при наличии соответствующего функционала Сайта.
          </li>
          <li>
            Персональная информация Пользователя обрабатывается Администрацией Сайта в течение срока ее размещения
            на Сайте или срока, установленного действующим законодательством.
          </li>
          <li>
            Без ущерба для иных положений Соглашения Администрация Сайта имеет право передать Персональную
            информацию Пользователя третьим лицам в следующих случаях:
            <ol>
              <li>Пользователь выразил свое согласие на такие действия;</li>
              <li>
                Передача необходима в рамках использования Пользователем Сайта либо для оказания услуг Пользователю;
              </li>
              <li>
                Такая передача предусмотрена российским или иным применимым законодательством в рамках установленной
                законодательством процедуры;
              </li>
              <li>
                Такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при этом к
                приобретателю переходят все обязательства по соблюдению условий настоящего Соглашения применительно к
                полученной им Персональной информации Пользователя;
              </li>
              <li>
                В целях обеспечения возможности защиты прав и законных интересов Администрации Сайта или третьих лиц в
                случаях, когда пользователь нарушает условия настоящего Соглашения;
              </li>
              <li>
                Передача между аффилированными с Администрацией Сайта лицами. В данном случае к получателю переходят все
                обязательства по соблюдению условий настоящего Соглашения применительно к полученной им Персональной
                информации Пользователя.
              </li>
            </ol>
          </li>
          <li>
            При обработке персональных данных Пользователя Администрация Сайта руководствуется Федеральным законом
            Российской Федерации от 27 июля 2006 г. № 152-ФЗ «О персональных данных».
          </li>
        </ol>
      </li>
      <li>
        Размещение на Сайте Информации
        <ol>
          <li>
            Размещая Информацию на Сайте, Пользователь гарантирует, что обладает всеми необходимыми правами для размещения Информации на Сайте. Если у Пользователя нет надлежащих прав для размещения на Сайте какой-либо Информации, то Пользователь обязуется не размещать такую Информацию.
          </li>
          <li>
            Пользователь обязуется при размещении Информации на Сайте:
            <ol>
              <li>
                Не размещать на Сайте и не направлять куда-либо через/посредством Сайта следующую Информацию:
                клеветническую, оскорбительную, порочащую/унижающую честь и/или достоинство третьих лиц, содержащую
                угрозы; нарушающую права граждан на частную жизнь и публичный порядок; пропагандирующую дискриминацию
                людей по расовому, этническому, половому, религиозному признакам, социальному статусу, сексуальной
                ориентации или иным признакам; содержащую экстремистские материалы, способствующую и/или призывающую к
                изменению конституционного строя, развязыванию войны, религиозной, расовой или межнациональной розни,
                содержащую попытки разжигания вражды или призывы к насилию; содержащую порнографические материалы или иные
                оскорбляющие нравственность материалы; оскорбляющую религиозные чувства граждан; информацию «заказного»
                характера, т.е. Информацию, созданную в чьих-либо интересах, несоответствующих целям создания Сайта; не
                размещать на Сайте и не направлять куда-либо через/посредством Сайта иную Информацию, не соответствующую
                законодательству Российской Федерации и/или настоящему Соглашению;
              </li>
              <li>
                Не публиковать Информацию на Сайте, минуя порядок размещения Информации, установленный
                Администрацией Сайта;
              </li>
              <li>
                Не распространять на Сайте и/или через Сайт компьютерные вирусы или другие компьютерные коды, файлы
                или программы, предназначенные для нарушения, модификации, блокирования уничтожения либо ограничения
                функциональности любого компьютерного или телекоммуникационного оборудования, или программы для
                осуществления несанкционированного доступа, а также серийные номера к коммерческим программным продуктам и
                программы для их генерации, логины, пароли и прочие средства для получения несанкционированного доступа к
                Сайту, а также к платным ресурсам в сети Интернет;
              </li>
              <li>
                Не размещать или иным способом не использовать на Сайте Информацию, охраняемую законодательством об
                интеллектуальной собственности (в том числе, но не ограничиваясь, которая затрагивает какой-либо патент,
                товарный знак, авторские и/или смежные с ними права), и иную охраняемую законом Информацию без
                соответствующих на то прав и разрешений от правообладателя такой Информации;
              </li>
              <li>
                Не размещать на Сайте Информацию коммерческого характера за исключением мест и сервисов специально
                предназначенных для этого с разрешения Администрации Сайта;
              </li>
              <li>
                Не размещать на Сайте ссылки на другие Интернет-ресурсы, содержание которых противоречит требованиям
                законодательства Российской Федерации и/или настоящему Соглашению;
              </li>
              <li>
                Не распространять на Сайте и/или через Сайт спам, «письма счастья», системы интернет заработка,
                схемы «пирамид», многоуровнего маркетинга, e-mail-бизнесов;
              </li>
              <li>
                Не регистрироваться и не совершать действия на Сайте от имени другого реально существующего или
                существовавшего лица, не указывать персональную информацию третьих лиц, не применять любые формы и способы
                незаконного представительства третьих лиц.
              </li>
            </ol>
          </li><li>
            Администрация Сайта предоставляет Пользователю возможность размещать Информацию на Сайте и пользоваться
            сервисами Сайта исключительно в рамках предоставленного функционала Сайта.
          </li>
          <li>
            Любая Информация, размещаемая на Сайте Пользователем, соответственно, принадлежит такому Пользователю
            или соответствующему третьему лицу. Размещая Информацию на Сайте, Пользователь подтверждает, что он обладает
            всеми необходимыми для этого правами и полномочиями, также Пользователь соглашается с тем, что такая
            Информация становится доступной для Пользователей Сайта.
          </li>
          <li>
            Размещая Информацию на Сайте, Пользователь автоматически безвозмездно, безусловно и безотзывно
            предоставляет Администрации Сайта неисключительное право на использование такой Информации на территории всего
            мира без ограничения срока по усмотрению Администрации Сайта, в том числе но не ограничиваясь, на
            воспроизведение, копирование, подбор, систематизацию, преобразование, изменение, редактирование, перевод,
            опубликование, распространение такой Информации (частично или полностью) любыми законными способами. Также,
            размещая Информацию на Сайте, Пользователь подтверждает, что обладает соответствующими правами и полномочиями
            для предоставления Администрации Сайта указанного выше неисключительного права на использование размещенной
            Информации. При таком использовании Администрация Сайта имеет право использовать соответствующую Информацию
            как с указанием имени автора такой Информации, так и без указания имени автора (в качестве имени автора при
            этом будет указываться имя Пользователя, разместившего Информацию, которое он указал при регистрации на Сайте
            или в настройках Учетной записи либо логин Пользователя). Администрация Сайта вправе передавать права,
            указанные в настоящем пункте третьим лицам.
          </li>
          <li>
            Администрация Сайта не несет никакой ответственности за достоверность и правомерность Информации,
            размещенной Пользователями на Сайте.
          </li>
          <li>
            Администрация Сайта не проверяет и не имеет технической и фактической возможности проверять всю
            Информацию, размещаемую Пользователем на Сайте, на предмет ее соответствия требованиям законодательства
            Российской Федерации и положениям настоящего Соглашения, поскольку подобная проверка сделает невозможным
            функционирование Сайта. Однако Администрация Сайта может это делать в любое время по своему усмотрению.
          </li>
          <li>
            В случае возникновения спорной ситуации бремя доказывания того, что размещаемая Пользователем Информация
            не нарушает чьих-либо прав, лежит на таком Пользователе.
          </li>
          <li>
            Администрация Сайта может по своему усмотрению отказать в размещении, удалить и/или отредактировать
            любую Информацию, которую Пользователь собирается разместить/разместил на Сайте, в том числе без объяснения
            причин.
          </li>
          <li>
            В случаях, предусмотренных применимым законодательством, Администрация Сайта рассматривает Информацию,
            размещенную Пользователем на Сайте, к которой Пользователь ограничил доступ для третьих лиц с использованием
            функционала Сайта, как коммерческую тайну Пользователя. Администрация Сайта обязуется не передавать такую
            Информацию третьим лицам (за исключением случаев передачи такой Информации между аффилированными с
            Администрацией Сайта лицами или в рамках установленной действующим законодательством процедуры).
          </li>
          <li>
            Размещение отдельных видов Информации (объявлений о продаже или аренде объектов, а также Информации,
            размещаемой на Форуме) дополнительно регулируется соответствующими разделами настоящего Соглашения, а также
            иными документами, регулирующими порядок оказания услуг по размещению отдельных видов Информации, с которыми
            Пользователь соглашается при заказе соответствующих услуг.
          </li>
        </ol>
      </li>
      <li>
        Использование Сайта
        <ol>
          <li>
            Использование Сайта Пользователем допускается только в соответствии с настоящим Соглашением и исключительно способами, предусмотренными техническими возможностями и интерфейсом Сайта.
          </li>
          <li>
            Пользователь обязуется при использовании Сайта:
            <ol>
              <li>Не нарушать нормальную работу Сайта;</li>
              <li>
                Не распространять и/или не использовать какие-либо компьютерные программы, роботы («пауки») или
                другие автоматические алгоритмы и методы, направленные на незаконные: «выкачивание» (сбор), передачу,
                копирование, блокирование, модификацию, уничтожение Информации и Базы данных, а также направленные на
                обход ограничений, установленных Администрацией Сайта в настройках Сайта;
              </li>
              <li>
                Не использовать контактные данные Пользователей для проведения незаконных рассылок, в том числе, но
                не ограничиваясь, SMS-рассылками, совершаемыми без согласия адресата;
              </li>
              <li>
                Не совершать посредством Сайта действия, направленные на вымогательство или получение денег,
                независимо от предлога, от других Пользователей и/или третьих лиц;
              </li>
              <li>
                Не содействовать в совершении и/или не совершать с использованием Сайта иные противоправные,
                противозаконные действия, противоречащие требованиям законодательства Российской Федерации и/или
                настоящего Соглашения.
              </li>
            </ol>
          </li>
          <li>
            Без письменного разрешения Администрации Сайта Пользователь обязуется не использовать автоматические программы для получения доступа к Сайту в целях извлечения, сбора, переработки, копирования, и/или последующего распространения Информации, представленной на Сайте и/или в Базе данных.
          </li>
        </ol>
      </li>
      <li>
        Функционирование Сайта и ответственность при его использовании
        <ol>
          <li>
            Администрация Сайта не гарантирует, что Информация, размещенная на Сайте, будет доступна в любое время, или
            не будет удалена или утеряна. Администрация Сайта не несет ответственности за сбои и задержки в работе Сайта,
            а также за возможные последствия таких сбоев и задержек.
          </li>
          <li>
            Администрация Сайта не несет ответственности за возможную утечку Информации из Базы данных Сайта по
            любым причинам, в том числе в результате несанкционированных действий третьих лиц.
          </li>
          <li>
            Администрация Сайта не несет ответственности за наличие на Сайте вирусов, а также за возможные
            последствия заражения компьютера Пользователя вирусами или попадание на компьютер Пользователя иных
            вредоносных программ. Администрация Сайта предоставляет Сайт Пользователю «как есть» без каких-либо
            дополнительных гарантий.
          </li>
          <li>
            Администрация Сайта не отвечает, не возмещает и не несет ответственности за любые убытки, включая
            упущенную выгоду, моральный и иной вред, причиненные Пользователю или третьим лицам в результате использования
            ими Сайта или в связи с функционированием Сайта, в том числе, за убытки, связанные с принятием каких-либо
            решений и действий, основанных на Информации, размещенной на Сайте.
          </li>
          <li>
            Ссылка на любой сайт, продукт, услугу, любую информацию, размещенная на Сайте Пользователем, не является
            одобрением или рекомендацией данных продуктов (услуг, информации) со стороны Администрации Сайта.
          </li>
          <li>
            Пользователь самостоятельно возмещает любые убытки (в том числе упущенную выгоду, моральный и иной
            вред), возникшие у других Пользователей, третьих лиц или Администрации Сайта вследствие нарушения
            Пользователем настоящего Соглашения, в том числе вследствие размещения на Сайте Информации, а также вследствие
            совершения иных действий, связанных с использованием Сайта.
          </li>
          <li>
            Пользователь обязуется своими силами и за свой счет разрешать все споры и урегулировать все претензии и
            иски третьих лиц, предписания и требования уполномоченных государственных органов власти, поступившие как в
            адрес Пользователя, так и в адрес Администрации Сайта в связи с нарушением Пользователем настоящего Соглашения
            или в связи с совершением Пользователем иных противоправных действий при использовании Сайта, а также
            возместить все убытки и расходы, понесенные Администрацией Сайта в связи с такими претензиями и исками.
          </li>
          <li>
            Администрация Сайта не несет ответственности по договорам между Пользователями и/или Пользователем и
            любыми третьими лицами, заключенным в связи использованием Сайта, в том числе за услуги третьих лиц, которые
            Пользователь использует для оплаты услуг, оказываемых Администрацией сайта (услуги операторов мобильной связи
            при оплате услуг, оказываемых Администраций Сайта, с помощью SMS, услуги электронных платежных систем и т.д.).
          </li>
        </ol>
      </li>
      <li>
        Иные положения
        <ol>
          <li>
            Настоящее Соглашение регулируется и толкуется в соответствии с законодательством Российской Федерации.
            Вопросы, не урегулированные настоящим Соглашением, подлежат разрешению в соответствии с законодательством
            Российской Федерации. Все возможные споры, вытекающие из отношений, регулируемых настоящим Соглашением,
            разрешаются в порядке, установленном действующим законодательством Российской Федерации, по нормам российского
            права.
          </li>
          <li>
            Пользователь и Администрация Сайта будут пытаться решить все возникшие между ними споры и разногласия
            путем переговоров. В случае невозможности разрешить споры и разногласия путем переговоров они подлежат
            рассмотрению в соответствующем суде по месту нахождения Администрации Сайта.
          </li>
          <li>
            К услугам, оказываемым Пользователям Администрацией Сайта в рамках настоящего Соглашения, не применяются
            нормы о защите прав потребителей ввиду их безвозмездности.
          </li>
          <li>
            Ничто в Соглашении не может пониматься как установление между Пользователем и Администрацией Сайта
            агентских отношений, отношений товарищества, отношений по совместной деятельности, отношений личного найма,
            либо каких-то иных отношений, прямо не предусмотренных Соглашением.
          </li>
          <li>
            Если по тем или иным причинам одно или несколько положений настоящего Соглашения будут признаны
            недействительными или не имеющими юридической силы, это не оказывает влияния на действительность или
            применимость остальных положений Соглашения.
          </li>
          <li>
            Бездействие со стороны Администрации Сайта в случае нарушения Пользователем либо иными Пользователями
            положений Соглашения не лишает Администрацию Сайта права предпринять соответствующие действия в защиту своих
            интересов позднее, а также не означает отказа Администрации Сайта от своих прав в случае совершения в
            последующем подобных либо сходных нарушений.
          </li>
          <li>
            Настоящее Соглашение может быть изменено Администрацией Сайта в одностороннем порядке. Новая редакция
            Соглашения вступает в силу с момента ее размещения в сети Интернет по указанному в настоящем пункте адресу,
            если иное не предусмотрено новой редакцией Соглашения. Действующая редакция Соглашения всегда находится на
            странице по адресу kvarum.ru/tos В случае если Администрацией Сайта были внесены какие-либо изменения в
            Соглашение, с которыми Пользователь не согласен, он обязан прекратить использование Сайта.
          </li>
        </ol>
      </li>
      <li>
        Общие правила публикации объявлений объектов
        <ol>
          <li>Все объявления принимаются к публикации только на русском языке.</li>
          <li>
            Размещенные объявления могут проходить модерацию – проверку объявлений Администрацией Сайта на
            корректность содержания и соответствие настоящему Пользовательскому Соглашению.
          </li>
          <li>
            Публикация одинаковых или сходных по большинству параметров объявлений (в том числе с разных Учетных
            записей), а также публикация (в целях изменения даты публикации) объявлений, которые одинаковы или сходны с
            ранее удаленными объявлениями (до истечения 30 дней с момента удаления такого объявления), запрещены.
          </li>
          <li>
            При размещении объявления необходимо соблюдать следующие правила:
            <ol>
              <li>Внимательно, последовательно и точно указывать Информацию в форме подачи объявления;</li>
              <li>
                Подробно и точно указывать в соответствии с документами данные, характеризующие объект (тип,
                площадь, этаж, этажность и т. п.)
              </li>
              <li>
                Объявление должно содержать максимально подробную информацию о предлагаемом объекте. Информация
                должна быть актуальной и соответствовать действительности;
              </li>
              <li>
                Изображения (фотографии, видеоматериалы), демонстрирующие объект, должны соответствовать содержимому
                объявления, использование которых в объявлении не нарушает чьих-либо интеллектуальных прав. На изображении
                должен быть только предлагаемый объект в том состоянии, в котором он находится.
              </li>
            </ol>
          </li>
          <li>
            При размещении объявления запрещается:
            <ol>
              <li>Указывать заниженную или неактуальную цену;</li>
              <li>
                Размещать на фотографиях или видеоматериалах: товарные знаки, фирменные наименования и коммерческие
                обозначения, права на которые принадлежат третьим лицам;
              </li>
              <li>Указывать неправильный или недействительный номер контактного телефона;</li>
              <li>
                Размещать объявления о продаже/аренде объектов, в отношении которых уже достигнуто соглашение об их
                продаже третьим лицам и внесены аванс или задаток;
              </li>
              <li>
                Размещать объявления о продаже квартир по договору ренты, в том числе договора пожизненного
                содержания с иждивением, а также о продаже объектов с условием дальнейшего проживания в них третьих лиц.
              </li>
            </ol>
          </li>
          <li>
            При заполнении в объявлении полей «Дополнительная информация», «Описание» запрещается:
            <ol>
              <li>Давать ссылки на какие-либо сайты или адреса электронной почты;</li>
              <li>Указывать телефоны (вся контактная информация указывается в форме размещения объявления);</li>
              <li>Указывать цену;</li>
              <li>
                Рекламировать другие объекты, за исключением парковочного места, относящегося к данному конкретному
                объекту.
              </li>
              <li>
                Предлагать какие-либо услуги, не связанные с рекламируемым объектом, в частности, запрещено
                указывать, информацию о страховании, кредитовании и т.п.
              </li>
            </ol>
          </li>
          <li>
            Если объект уже сдан, продан или находится под авансом, данное объявление считается неактуальным и должно
            быть снято с публикации в течение 24-х часов с момента наступления этого события. В случае если возможность
            просмотра объекта еще не наступила и наступит не ранее, чем через 7 дней, то объявление считается
            неактуальным.
          </li>
          <li>
            Пользователи могут размещать на Сайте объявления о продаже квартир/апартаментов в строящихся домах,
            выступая в интересах только физического лица, и при условии продажи объекта по договору уступки прав.
          </li>
          <li>
            Пользователи не могут размещать на Сайте объявления о продаже квартир/апартаментов в строящихся домах,
            выступая в интересах любого юридического лица. Такая возможность доступна только с согласия Администрации
            Сайта на платной основе.
          </li>
          <li>Срок хранения объявлений на Сайте для Пользователей составляет 30 дней.</li>
          <li>
            Администрация Сайта оставляет за собой право на удаление объявлений, которые по её мнению нарушают
            настоящее Соглашение или нарушают иные обязательства Пользователя перед Администрацией Сайта, а также на
            блокировку доступа Пользователей к Сайту для предотвращения дальнейших нарушений. В случае удаления по
            основаниям, указанным в настоящем пункте, оплаченных объявлений или объявлений, в отношении которых
            Пользователем были приобретены дополнительные услуги, в соответствии с п. 2. ст. 781 гражданского кодекса
            Российской Федерации услуга не оказывается по вине Пользователя, и оплаченные денежные средства не
            возвращаются.
          </li>
        </ol>
      </li>
    </ol>
  </div>
</template>

<script>
    export default {
        name: "TosText",
      props:{
          showTitle:{
            type:Boolean,
            default:true
          }
      }
    }
</script>

<style module>
.tosOl>li{
  font-weight: 700;
}
.tosOl li ol li{
  font-weight: normal;
}
.tosOl ol{
  display: block;
  margin-block-start: 0.5em;
  margin-block-end: 0.5em;
  margin-inline-start: 0;
  margin-inline-end: 0;
  padding-inline-start: 20px;
}
</style>
